---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.PowerFactorState
source: html/7530c368-0ffd-c88d-0c05-ea0539800f0b.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.PowerFactorState Property

The PowerFactorState type of the Electrical System.

## Syntax (C#)
```csharp
public PowerFactorStateType PowerFactorState { get; }
```

## Remarks
This property is used to retrieve the PowerFactorState type of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!